Revit 2027 API
SingleServerService.GetActiveServerId Method
Overload List
Name | Description
GetActiveServerId() |  Returns the Id of the currently active application-level server of the service.
GetActiveServerId(Document) |  Returns the Id of the server currently associated with the given document for the service.
Top
See Also
Reference
SingleServerService Class
Autodesk.Revit.DB.ExternalService Namespace